rinha_api/app/use_cases/create_transaction_use_case.rb

UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 1000], ["updated_at", "2024-02-16 14:38:08.337044"], ["id", 1]]
---
  def call
    @account.with_lock do
      @account.reload

      account_has_limit?
      create_transaction
      update_account_balance

      @account.save!

INSERT INTO "transactions" ("account_id", "amount", "kind", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["account_id", 1], ["amount", 1], ["kind", 1], ["description", "descricao"], ["created_at", "2024-02-16 14:45:01.859135"], ["updated_at", "2024-02-16 14:45:01.859135"]]
---
  def create_transaction
    @transaction = Transaction.create!(amount: @amount, kind: @kind, description: @desciption, account: @account)