rinha_api/app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 ORDER BY "transactions"."created_at" DESC LIMIT $2  [["account_id", 1], ["LIMIT", 10]]
---
  def extract
    @account = ::Account.find(params[:account_id])

    @transactions = @account.transactions.order(created_at: :desc).limit(10)

    render json: {
      "saldo": {
        "total": @account.balance,
        "data_extrato": Time.now,
        "limite": @account.limit
      },
      "ultimas_transacoes": @transactions.map do |transaction|