rinha_api/app/controllers/transactions_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def load_account
    @account = ::Account.find(params[:account_id])